cases/column_fine_LES/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

LES
{
    LESModel        Smagorinsky;

/*
DeardorffDiffStress
Smagorinsky
SpalartAllmarasDDES
SpalartAllmarasDES
SpalartAllmarasIDDES
WALE
dynamicKEqn
dynamicLagrangian
kEqn
kOmegaSSTDES
*/

    turbulence		on;
    printCoeffs		on;

//Smagorinsky coefficients
/*
    SmagorinskyCoeffs
    {
        Ck                  0.094;
        Ce                  1.048;
    }
*/

/*
cs^2=ck sqrt(ck/ce)
*/

    delta           cubeRootVol;

/*
IDDESDelta
Prandtl
cubeRootVol
maxDeltaxyz
smooth
vanDriest
*/

    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }

/*
    PrandtlCoeffs
    {
        delta           cubeRootVol;

        
	cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }

        smoothCoeffs
        {
            delta           cubeRootVol;
            cubeRootVolCoeffs
            {
                deltaCoeff      1;
            }

            maxDeltaRatio   1.1;
        }
	

        Cdelta          0.158;
    }
*/

/*
    vanDriestCoeffs
    {

        delta           smooth;

        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }

        smoothCoeffs
        {
            delta           cubeRootVol;
            cubeRootVolCoeffs
            {
                deltaCoeff      1;
            }

            maxDeltaRatio   1.1;
        }

        Aplus           26;
        Cdelta          0.158;

    }
*/

/*
    smoothCoeffs
    {

        delta           cubeRootVol;

        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }

        maxDeltaRatio   1.1;
    }
*/

}

// ************************************************************************* //
